/* exec to create linux kernel card deck */
Address Command

Arg fn ft .
If fn="" Then fn="VMLINUX"
If ft="" Then ft="KERNEL10"

'PIPE <' fn ft 'A | REXX LINUXTXT | > KERNEL TEXT A F 80'

'CP SPOOL PUNCH CONT TO *'
'PUNCH LINUX390 LOADER A (NOH'
'PUNCH KERNEL TEXT A (NOH'
'CP SPOOL PUNCH NOCONT CLOSE'

Say ""
Say "Ok, IPL that card deck *WITH DISCRETION*!!!"
/* cp ipl 00C clear stop */
/* cp ipl 00C clear stop parm root=1B0 ro cons=01F 3270 */

Exit

